---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IDuplicateTypeNamesHandler
source: html/849445d0-c87a-7e91-df43-41daf2605640.htm
---
# IDuplicateTypeNamesHandler Members

Called when the destination document contains types with the same names as the types being copied.